RDVMI.rdvmi-ext/src/InformationRegisters/рдв_СообщенияОбмена/рдв_СообщенияОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_СообщенияОбмена</name>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.рдв_СтатусыСообщенийОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.рдв_ВидыСообщенийОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРегистрацииВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыгружаемыйОбъект</name>
    <type>
      <types>CatalogRef.рдв_ВыгружаемыеОбъекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/Enums/рдв_ВидыСообщенийОбмена/рдв_ВидыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ВидыСообщенийОбмена</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/Enums/рдв_СтатусыСообщенийОбмена/рдв_СтатусыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_СтатусыСообщенийОбмена</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Загружено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_СообщенияОбмена/ManagerModule.bsl
Функция ЗарегистрироватьИзменениеОбъекта(ВыгружаемыйОбъект) Экспорт
	
	ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись = РегистрыСведений.рдв_СообщенияОбмена.СоздатьМенеджерЗаписи();
	Запись.ВидСообщения = Перечисления.рдв_ВидыСообщенийОбмена.Исходящее;
	Запись.ДатаРегистрацииВМиллисекундах = ТекущаяДатаВМиллисекундах;
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ВыгружаемыйОбъект = ВыгружаемыйОбъект;
	Запись.ДатаРегистрации = ТекущаяДата;
	Запись.Статус = Перечисления.рдв_СтатусыСообщенийОбмена.Новое;
	
	Запись.Записать();
	
	Возврат ИдентификаторСообщения;
	
КонецФункции

Процедура ОбновитьСтатусСообщения(ИдентификаторСообщения, Статус, ТекстСообщения = "", ТекстОшибки = "") Экспорт
	
	НачатьТранзакцию();

	Попытка;
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.рдв_СообщенияОбмена");
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторСообщения", ИдентификаторСообщения);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();	
		
		НаборЗаписей = РегистрыСведений.рдв_СообщенияОбмена.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
			Запись.Статус = Статус;
			Запись.ТекстСообщения = ТекстСообщения;
			Запись.ТекстОшибки = ТекстОшибки;
		КонецЕсли;
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
		
	
КонецПроцедуры
